In [2]:
import numpy as np
import pandas as pd

#### **Creating a Data Frame**

In [4]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}

df=pd.DataFrame(data)

In [5]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [12]:
data_list=[
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 72000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London',85000]
]
cols=['name','age','city','salary']

df2=pd.DataFrame(data_list,columns=cols)
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   72000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

#### **Selection and Indexing of column**

In [13]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   72000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [19]:
df2[['name','age']]

    name  age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

#### **Creating new column**

In [20]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   72000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [34]:
df2['designation']=['AI engg','Data scientist','Web devloper','SDE']
df2

    name  age      city  salary     designation
0   John   28  New York   65000         AI engg
1   Anna   34     Paris   72000  Data scientist
2  Peter   29    Berlin   62000    Web devloper
3  Linda   42    London   85000             SDE

#### **Removing columns**

In [35]:
df2.drop('designation',axis=1,inplace=True)
#inplace=true:-  changes the original data frame in memory
# if not mentioned then inplace is false and virtual copy of changed data frame is provided

In [39]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   72000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [38]:
df2.drop(['city','salary'],axis=1)

    name  age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [40]:
df.drop(0,axis=0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

#### **Selecting Rows**

In [41]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   72000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [44]:
df2.loc[[0,1]]

   name  age      city  salary
0  John   28  New York   65000
1  Anna   34     Paris   72000

In [45]:
df2.iloc[3]

name       Linda
age           42
city      London
salary     85000
Name: 3, dtype: object

#### **Selecting Subsets of rows and columns**

In [52]:
df2.loc[[0,1]][['city','salary']]

       city  salary
0  New York   65000
1     Paris   72000

In [54]:
df2.loc[[2,3]][['name','age']]

    name  age
2  Peter   29
3  Linda   42

#### **Conditional Selection**

In [55]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   72000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
#age above 30
df2[df2['age']>30]

    name  age    city  salary
1   Anna   34   Paris   72000
3  Linda   42  London   85000

In [ ]:
#age above 30 and from paris
df2[(df2['city']=='Paris') & (df2['age']>30)]

   name  age   city  salary
1  Anna   34  Paris   72000